Revit 2027 API
ParameterTypeId.ExchangeEntityId Property
 "Exchange Entity ID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ExchangeEntityId { get; }
Public Shared ReadOnly Property ExchangeEntityId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ExchangeEntityId {
	ForgeTypeId^ get ();
}
static member ExchangeEntityId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace